Repository: MoathCodes/daily_task_analyzer
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Daily Task AI Evaluator
ar: مقيّم المهام اليومية بالذكاء الاصطناعي

# homeTitle
source: Progress Dashboard
ar: لوحة متابعة التقدم

source: Progress
ar: التقدم

source: No entries yet
ar: لا توجد إدخالات بعد

# addFirstTaskPrompt
source: Add your first daily task to see progress metrics.
ar: أضف أول مهمة يومية لعرض مقاييس التقدم.

source: Vocabulary Quality
ar: جودة المفردات اللغوية

source: Word Count
ar: إجمالي عدد الكلمات

source: Total Entries
ar: إجمالي الإدخالات

# avgLettersPerWord
source: Avg. L/W
ar: متوسط حروف/كلمة

# wordsPerEntry
source: Words/Entry
ar: كلمات لكل إدخال

source: Tasks Logged
ar: المهام المسجّلة

source: New Task
ar: مهمة جديدة

source: Add New Task
ar: إضافة مهمة جديدة

source: Recent Entries
ar: الإدخالات الأخيرة

# noEntriesYetTitle
source: No entries yet
ar: لا توجد إدخالات بعد

# useNewTaskButton
source: Use the "New Task" button to create your first daily task
ar: استخدم زر "مهمة جديدة" لإنشاء أول مهمة يومية لك

# tapPlusButton
source: Tap the + button to create your first daily task
ar: اضغط على زر + لإنشاء أول مهمة يومية لك

# selectEntryDetails
source: Select an entry to see details
ar: اختر إدخالاً لرؤية التفاصيل

source: Your Writing Progress
ar: تقدم كتابتك

# trackQualityQuantity
source: Track quality, quantity, and AI feedback across your journal entries.
ar: تابع الجودة والكمية وملاحظات الذكاء الاصطناعي عبر إدخالات يومياتك.

# wordsPerEntrySlash
source: Words / Entry
ar: كلمات لكل إدخال

source: New Daily Task
ar: إضافة مهمة يومية جديدة

# pleaseEnterText
source: Please enter some text to analyze
ar: يرجى إدخال نص ليتم تحليله

# analysisFailed
source: Analysis failed: {error}
ar: فشل التحليل: {error}

source: Insights appear here
ar: ستُعرض الرؤى هنا

# insightsDescription
source: Write your daily reflections and tap "Analyze with AI" to generate feedback and key vocabulary suggestions.
ar: اكتب تأملاتك اليومية واضغط على "تحليل بالذكاء الاصطناعي" للحصول على ملاحظات واقتراحات لأهم المفردات.

source: Analysis Results
ar: نتائج التحليل التفصيلي

source: Words
ar: كلمات

source: Avg L/W
ar: متوسط ح/ك

source: Clarity
ar: الوضوح

source: Key Metrics Explanation
ar: شرح المؤشرات الرئيسية

source: AI Feedback
ar: ملاحظات من الذكاء الاصطناعي

source: Strong Words
ar: كلمات قوية

# captureReflection
source: Capture today's reflection
ar: دوّن تأملات اليوم

# captureReflectionDescription
source: Describe what you learned, built, or observed. Richer details help the AI deliver more nuanced insights.
ar: صِف ما تعلّمته أو أنجزته أو لاحظته اليوم. التفاصيل الغنية تساعد الذكاء الاصطناعي على تقديم رؤى أدق وأعمق.

# entryPlaceholder
source: Write or paste your daily task entry here... (e.g., 'Flutter is a cross-platform app development framework...')
ar: اكتب أو الصق هنا إدخال مهمتك اليومية... (مثال: "فلاتر إطار عمل لتطوير التطبيقات متعددة المنصات...")

source: Analyze with AI
ar: حلّل بالذكاء الاصطناعي

# runAnalysisPrompt
source: Run an analysis to unlock AI-generated insights.
ar: قم بتشغيل التحليل للحصول على رؤى من الذكاء الاصطناعي.

source: Save to History
ar: حفظ في السجلّ

source: Quality
ar: الجودة

source: Quantity
ar: الكمية

source: Analysis Details
ar: تفاصيل نتائج التحليل

source: Your Entry
ar: إدخالك

source: Quantitative Metrics
ar: المقاييس الكمية

source: Key Vocabulary
ar: أهم المفردات

source: AI Qualitative Feedback
ar: الملاحظات النوعية من الذكاء الاصطناعي

# lettersSuffix
source: L/W
ar: ح/ك

# wordsSuffix
source: W
ar: ك

# fallbackFeedback
source: Your writing has {wordCount} words with an average of {avgLetters} letters per word. Keep practicing to improve vocabulary richness!
ar: يحتوي نصّك على {wordCount} كلمة بمتوسط {avgLetters} حرفًا لكل كلمة. استمر في الكتابة لتحسين ثراء مفرداتك!

# fallbackKeyMetric
source: Average word length: {avgLetters} letters. Keep working on using more descriptive words.
ar: متوسط طول الكلمة: {avgLetters} حرفًا. استمر في محاولة استخدام كلمات أكثر وصفًا.

# fallbackKeyMetricError
source: Keep working on your writing skills.
ar: واصل تطوير مهاراتك في الكتابة.

# fallbackFeedbackBasic
source: Good effort! Keep writing.
ar: عمل جيّد! استمر في الكتابة.

# fallbackKeyMetricBasic
source: Unable to calculate metrics.
ar: تعذّر حساب المؤشرات.

source: Text cannot be empty
ar: لا يمكن أن يكون النص فارغًا
